app/helpers/national_rail_api_helper.rb

require 'rest_client'
module NationalRailApiHelper

  DEBUG = true
  URL = 'https://lite.realtime.nationalrail.co.uk/OpenLDBWS/ldb6.asmx'
  ACCESS_TOKEN = Rails.application.secrets.access_token
  SOAP_HEADERS = '<?xml version="1.0"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://thalesgroup.com/RTTI/2014-02-20/ldb/" xmlns:ns2="http://thalesgroup.com/RTTI/2010-11-01/ldb/commontypes"><SOAP-ENV:Header><ns2:AccessToken><ns2:TokenValue>' + ACCESS_TOKEN + '</ns2:TokenValue></ns2:AccessToken></SOAP-ENV:Header>'


  def self.get_departure_board crs    
    type = "DepartureBoard"
    return NationalRailApiHelper.get_board type, crs
  end


  def self.get_arrival_board crs    
    type = "ArrivalBoard"
    return NationalRailApiHelper.get_board type, crs
  end
  

  def self.get_service service_id
    soap_body = '<SOAP-ENV:Body><ns1:GetServiceDetailsRequest><ns1:serviceID>' + service_id + '</ns1:serviceID></ns1:GetServiceDetailsRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>'
    begin
      if DEBUG
        service_id = "qUMA94O0CSyyZWRFkPQHeg="
        xml = '<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetServiceDetailsResponse xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/"><GetServiceDetailsResult><generatedAt xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">2015-04-13T20:24:31.6458223+01:00</generatedAt><serviceType xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">train</serviceType><locationName xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">Didcot Parkway</locationName><crs xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">DID</crs><operator xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">First Great Western</operator><operatorCode xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">GW</operatorCode><platform xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">1</platform><sta xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">20:41</sta><eta xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">On time</eta><std xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">20:42</std><etd xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">On time</etd><previousCallingPoints xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types"><callingPointList serviceType="train" serviceChangeRequired="false" assocIsCancelled="false"><callingPoint><locationName xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">London Paddington</locationName><crs xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">PAD</crs><st xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">20:00</st><at xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">On time</at></callingPoint><callingPoint><locationName xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">Reading</locationName><crs xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">RDG</crs><st xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">20:29</st><et xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">20:30</et></callingPoint></callingPointList></previousCallingPoints><subsequentCallingPoints xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types"><callingPointList serviceType="train" serviceChangeRequired="false" assocIsCancelled="false"><callingPoint><locationName xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">Swindon</locationName><crs xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">SWI</crs><st xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">21:00</st><et xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">On time</et></callingPoint><callingPoint><locationName xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">Chippenham</locationName><crs xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">CPM</crs><st xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">21:15</st><et xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">On time</et></callingPoint><callingPoint><locationName xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">Bath Spa</locationName><crs xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">BTH</crs><st xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">21:29</st><et xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">On time</et></callingPoint><callingPoint><locationName xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">Bristol Temple Meads</locationName><crs xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">BRI</crs><st xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">21:44</st><et xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">On time</et></callingPoint></callingPointList></subsequentCallingPoints></GetServiceDetailsResult></GetServiceDetailsResponse></soap:Body></soap:Envelope>'
        xml = Nokogiri::XML(xml)
      else
        response = RestClient.post URL, SOAP_HEADERS + soap_body, content_type: 'text/xml'
        puts response.body
        xml = Nokogiri::XML(response.body)
      end
    rescue => e
      puts e.inspect
      return
    end
    xml.remove_namespaces!
    service = Service.new service_id
    service.parse(xml)
    return service
  end


  def self.get_board type, crs
    soap_body = '<SOAP-ENV:Body><ns1:Get' + type + 'Request><ns1:crs>' + crs + '</ns1:crs></ns1:Get' + type + 'Request></SOAP-ENV:Body></SOAP-ENV:Envelope>'
    begin
      if DEBUG
        xml = '<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetDepartureBoardResponse xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/"><GetStationBoardResult><generatedAt xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">2015-04-13T20:21:43.2126223+01:00</generatedAt><locationName xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">Didcot Parkway</locationName><crs xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">DID</crs><nrccMessages xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types"><message xmlns="http://thalesgroup.com/RTTI/2012-01-13/ldb/types">Trains between London Paddington and Reading / Windsor &amp;amp; Eton Central  may be delayed by up to 20 minutes. More information can be found in &lt;A href="http://nationalrail.co.uk/service_disruptions/94944.aspx"&gt;Latest Travel News. &lt;/A&gt;</message></nrccMessages><platformAvailable xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types">true</platformAvailable><trainServices xmlns="http://thalesgroup.com/RTTI/2014-02-20/ldb/types"><service><origin><location><locationName>Oxford</locationName><crs>OXF</crs></location></origin><destination><location><locationName>Ealing Broadway</locationName><crs>EAL</crs></location></destination><std>20:01</std><etd>Delayed</etd><platform>4</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>oY9BBTFmAPXIcs7NAEB5Cg==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Oxford</locationName><crs>OXF</crs></location></destination><std>20:08</std><etd>20:21</etd><platform>4</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>gXILdrfHjV3Es/Joezemhw==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Weston-super-Mare</locationName><crs>WSM</crs></location></destination><std>20:12</std><etd>20:20</etd><platform>1</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>BLwaMTvzd08vpxYWJpznuA==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Oxford</locationName><crs>OXF</crs></location></destination><std>20:25</std><etd>20:29</etd><platform>3</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>wUhXSAKKrPWXQldNdhViig==</serviceID></service><service><origin><location><locationName>Bristol Temple Meads</locationName><crs>BRI</crs></location></origin><destination><location><locationName>London Paddington</locationName><crs>PAD</crs></location></destination><std>20:29</std><etd>On time</etd><platform>2</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>rRtOfU7jfhBMwGOBDRHAqA==</serviceID></service><service><origin><location><locationName>Oxford</locationName><crs>OXF</crs></location></origin><destination><location><locationName>Ealing Broadway</locationName><crs>EAL</crs></location></destination><std>20:31</std><etd>On time</etd><platform>4</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>1VJnp1QFNl8f2BAiZktCBg==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Worcester Shrub Hill</locationName><crs>WOS</crs><via>via Gloucester</via></location></destination><std>20:34</std><etd>On time</etd><platform>1</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>qc18u168FAvZ2GT8jQ589A==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Bristol Temple Meads</locationName><crs>BRI</crs></location></destination><std>20:42</std><etd>On time</etd><platform>1</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>qUMA94O0CSyyZWRFkPQHeg==</serviceID></service><service><origin><location><locationName>Swansea</locationName><crs>SWA</crs></location></origin><destination><location><locationName>London Paddington</locationName><crs>PAD</crs></location></destination><std>20:47</std><etd>21:02</etd><platform>2</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>cjFnhZ+BVJW1LZ2B0X7fqg==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Oxford</locationName><crs>OXF</crs></location></destination><std>20:57</std><etd>On time</etd><platform>3</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>z+6fvCjm/o27qgADLtjz9A==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Swansea</locationName><crs>SWA</crs></location></destination><std>20:57</std><etd>On time</etd><platform>1</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>TMsd0NtCACDGD4Of6cw6pg==</serviceID></service><service><origin><location><locationName>Banbury</locationName><crs>BAN</crs></location></origin><destination><location><locationName>Ealing Broadway</locationName><crs>EAL</crs></location></destination><std>21:01</std><etd>On time</etd><platform>4</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>pCB76eL9XrDmDe2jelJECQ==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Oxford</locationName><crs>OXF</crs></location></destination><std>21:25</std><etd>On time</etd><platform>3</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>sPgIRvjv7hWdMaNYp8v+Ew==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Bristol Temple Meads</locationName><crs>BRI</crs></location></destination><std>21:29</std><etd>On time</etd><platform>1</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>DiOcpO4J41g7y1eCY+31oQ==</serviceID></service><service><origin><location><locationName>Bristol Temple Meads</locationName><crs>BRI</crs></location></origin><destination><location><locationName>London Paddington</locationName><crs>PAD</crs></location></destination><std>21:30</std><etd>On time</etd><platform>2</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>LfS1/863fTNKI4hVSiiubg==</serviceID></service><service><origin><location><locationName>Oxford</locationName><crs>OXF</crs></location></origin><destination><location><locationName>Reading</locationName><crs>RDG</crs></location></destination><std>21:44</std><etd>On time</etd><platform>4</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>BH1mobhbdj0Zx5SgQMEz+A==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Oxford</locationName><crs>OXF</crs></location></destination><std>21:52</std><etd>On time</etd><platform>3</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>GCeqbDoeFDLdcVyCOKDWXw==</serviceID></service><service><origin><location><locationName>Swansea</locationName><crs>SWA</crs></location></origin><destination><location><locationName>London Paddington</locationName><crs>PAD</crs></location></destination><std>21:53</std><etd>On time</etd><platform>2</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>qYcOjLuST+5ijiJHqR1OQw==</serviceID></service><service><origin><location><locationName>London Paddington</locationName><crs>PAD</crs></location></origin><destination><location><locationName>Swansea</locationName><crs>SWA</crs></location></destination><std>22:01</std><etd>On time</etd><platform>1</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>I2tWABeuUmZLevcs2ycy0w==</serviceID></service><service><origin><location><locationName>Oxford</locationName><crs>OXF</crs></location></origin><destination><location><locationName>Reading</locationName><crs>RDG</crs></location></destination><std>22:08</std><etd>On time</etd><platform>4</platform><operator>First Great Western</operator><operatorCode>GW</operatorCode><serviceID>+UZSDKAPU04WH6vCtyQyaw==</serviceID></service></trainServices></GetStationBoardResult></GetDepartureBoardResponse></soap:Body></soap:Envelope>'
        xml = Nokogiri::XML(xml)
      else
        response = RestClient.post URL, SOAP_HEADERS + soap_body, content_type: 'text/xml'
        puts response.body
        xml = Nokogiri::XML(response.body)
      end
    rescue => e
      puts e.inspect
      return
    end
    xml.remove_namespaces!
    station_board = StationBoard.new
    station_board.parse(xml)
    return station_board
  end


end
